[{"title": "How Target Can Dominate This Holiday Season", "score": "neutral"}, {"title": "3 5G Stocks You Can Buy and Hold for the Next Decade", "score": "neutral"}, {"title": "Cathie Wood Goes Dumpster Diving: 3 Stocks She Just Bought", "score": "positive"}, {"title": "Disney Delivers The Bear Necessities", "score": "positive"}, {"title": "Outperforming The S&P 500 By Trading The Top 10 Stocks From 40 Large Hedge Funds: Trading Update 11/14/2021", "score": "neutral"}, {"title": "Retiring Early? Here's a Smart Investing Strategy to Consider", "score": "neutral"}, {"title": "Quarterly Review Of DivGro: Q3-2021", "score": "neutral"}, {"title": "Apple: Business Essentials Offering Could Be a Huge Deal", "score": "positive"}, {"title": "Strong Value And Dividend Pick In Big Tech: HP Inc.", "score": "neutral"}, {"title": "This Tech Stock Could Jump 56%, and It Is on Sale Right Now", "score": "neutral"}, {"title": "Intel Stock: Bull vs. Bear", "score": "neutral"}, {"title": "Apple to Pay $30 Million Over Store Workers Security Checks", "score": "negative"}, {"title": "Snap shareholder sues over Apple privacy tweak fallout", "score": "negative"}, {"title": "U.S. Companies Face New Risks in a Changing China. What That Means for the Stocks.", "score": "negative"}, {"title": "APPLE INC. : Change in Directors or Principal Officers, Amendments to Articles of Inc. or Bylaws; Change in Fiscal Year, Financial Statements and Exhibits (form 8-K)", "score": "neutral"}, {"title": "Apple Inc. stock rises Friday, outperforms market", "score": "positive"}, {"title": "US STOCKS-Wall Street ends higher with boost from big tech", "score": "positive"}, {"title": "GLOBAL MARKETS-Stocks rally, led by growth names, dollar eases", "score": "positive"}, {"title": "Foxconn Sees Supply Chain Crisis Lasting Till 2022, Bets On EV Partner Lordstown Motors", "score": "negative"}, {"title": "Warren Buffett just poured another $7.6 billion into his all-time favorite business here are 3 other companies doing something very similar", "score": "positive"}, {"title": "Why Jamf Holding Is Down More Than 20% Today", "score": "neutral"}, {"title": "Why You Should Use GAAP Earnings To Value Broadcom Stock", "score": "neutral"}, {"title": "US STOCKS-Wall Street advances, powered by big tech", "score": "neutral"}, {"title": "Why The Trade Desk Stock Is Skyrocketing This Week", "score": "positive"}, {"title": "iPhone Maker Foxconn Expects Supply-Chain Issues Until Second Half of 2022", "score": "negative"}, {"title": "US STOCKS-Wall Street powers higher on J&J, Big Tech boost", "score": "positive"}, {"title": "3 Dividend-Paying Tech Stocks to Buy in November", "score": "neutral"}, {"title": "Wall Street rises on J&J, Big Tech boost", "score": "positive"}, {"title": "How Big Should a Company Be? And Why This Question Matters for Investors", "score": "neutral"}, {"title": "Apple Is No Longer the World's Most Valuable Company", "score": "negative"}, {"title": "Why The Trade Desk Stock Is Skyrocketing This Week", "score": "positive"}, {"title": "U.S. stock futures edge higher on boost from J&J, tech stocks", "score": "positive"}, {"title": "Coupang Shares Drop As Net Loss Expands 87% In Q3", "score": "negative"}, {"title": "As Apple privacy change hinders Facebook and others, its own ad business stands to benefit", "score": "neutral"}, {"title": "U.S. Companies Face New Risks in a Changing China. What That Means for the Stocks.", "score": "negative"}, {"title": "Apple’s App Store Could Get Ad Revenue Boost From Privacy Push", "score": "positive"}, {"title": "Jim Cramer doubles down, says inflation-driven sell-offs are buying opportunities", "score": "positive"}, {"title": "Apple Inc. stock falls Thursday, underperforms market", "score": "negative"}, {"title": "Spotify bolsters audiobooks business with Findaway buy", "score": "neutral"}, {"title": "Apple CEO Tim Cook Is a Crypto Investor but the Company Won't Be Accepting Virtual Coins Anytime Soon", "score": "neutral"}, {"title": "Apple App Store Could Get Ad Revenue Boost From Privacy Push", "score": "positive"}, {"title": "Little-known iPhone photo trick quickly goes viral", "score": "positive"}, {"title": "Amazon (AMZN) Expands Latin America Presence Via New Launch", "score": "positive"}, {"title": "The stock exchange is growing throughout the working week", "score": "positive"}, {"title": "The stock market is showing good results", "score": "positive"}, {"title": "The stock market is growing on Wednesday at auction", "score": "positive"}, {"title": "Shares of all companies are falling", "score": "negative"}, {"title": "Stocks decline due to coronavirus", "score": "negative"}, {"title": "APPLE shares fall", "score": "negative"}, {"title": "Coronavirus exposes the beginning of the global crisis", "score": "negative"}, {"title": "U.S. Chamber of Commerce says businesses should implement vaccine mandate until it is 'shut down'", "score": "neutral"}, {"title": "The pandemic changed some small business owners attitudes about paid family leave", "score": "neutral"}, {"title": "The Ratings Game: Take-Two stock falls more than 5% after Rockstar Games has Grand Theft Auto trouble", "score": "negative"}, {"title": "Hollywood crew union narrowly ratifies new contract with industry producers", "score": "neutral"}, {"title": "Green Bay Packers to sell $90 million worth of stock in NFL team, only sixth time shares offered to public", "score": "neutral"}, {"title": "Investor Michael Burry Closes Short Bet Against Ark, Tesla, Treasuries", "score": "positive"}, {"title": "Hollywood Union Approves Contracts With Studios in Close Vote", "score": "neutral"}, {"title": "The Tell: This factor can trump pretty much anything else in S&P 500 performance, according to DataTrek", "score": "neutral"}, {"title": "Currencies: The U.S. dollar faces win-win scenario as it trades near 16-month high, analyst says", "score": "neutral"}, {"title": "Snap stock gains after company scores a new music partner", "score": "neutral"}, {"title": "Le Pen Says Macron Should Take Harder Line With Boris Johnson", "score": "neutral"}, {"title": "AmEx Requires Vaccine for Employees Returning to U.S. Offices", "score": "positive"}, {"title": "Amazon warehouse COVID-19 case notifications to be watched by California AG", "score": "neutral"}, {"title": "Cuban Authorities Appear to Largely Shut Down Planned Human-Rights Protests", "score": "neutral"}, {"title": "Coinbase Co-Founder Launches $2.5 Billion Crypto Venture Fund", "score": "positive"}, {"title": "Microsoft Surprises Gamers With 'Halo Infinite' Multiplayer Launch", "score": "positive"}, {"title": "Globus Makes Takeover Approach for NuVasive", "score": "neutral"}, {"title": "Cannabis Watch: Trulieve stock rallies after revenue beat for third quarter and CEO says company is on track to meet full-year goals", "score": "positive"}, {"title": "Commodities Corner: Why tapping the SPR is one of many bad options to ease gasoline prices", "score": "neutral"}, {"title": "As November child tax credits are delivered, parents have one last chance to sign up for advance payment", "score": "neutral"}, {"title": "Celebrity NFTs Risk 'Catastrophic Failure.' Just Ask John Cena", "score": "neutral"}, {"title": "Boris Johnson Indicates U.K. Wont Update Climate Targets Next Year", "score": "neutral"}, {"title": "Influential donors rally around New York's lieutenant governor ahead of next year's high-stakes campaign", "score": "neutral"}, {"title": "Retirement Hacks: The 4% rule is being debated again but here what you should do", "score": "neutral"}, {"title": "MoviePass Is Back. Will It Be the Next GameStop?", "score": "neutral"}, {"title": "Biden Could Revisit Renewable Fuel Mandate to Give Drivers Relief at Pumps", "score": "neutral"}, {"title": "Dutch Government Weighs Tax Changes in Bid to Stop Shell's Exit", "score": "neutral"}, {"title": "New York MTA Plans to Delay Fare Hikes for Six Months", "score": "neutral"}, {"title": "Big Data at Center of 2021's Latest Merger Monday", "score": "neutral"}, {"title": "The Ratings Game: CrowdStrike stock drops more than 10% as Morgan Stanley starts coverage with sell rating", "score": "negative"}, {"title": "MemeMoney: GameStop stock pops thanks to Ryan Cohens small wee wee", "score": "neutral"}, {"title": "Alex Jones Loses Sandy Hook Lawsuit, Will Be Liable for Damages", "score": "neutral"}, {"title": "4 ways to fund your retirement ethically", "score": "neutral"}, {"title": "Apollo Says Ferguson Is Barred From Joining Firm by Ex-Employer", "score": "neutral"}, {"title": "Stocks making the biggest moves midday: Boeing, Dollar Tree, Tesla and more", "score": "neutral"}, {"title": "The Ratings Game: EVgo stock tumbles after BofA says sell, citing recent EV charging euphoria and pending lockup expiry", "score": "negative"}, {"title": "Key Words: NBC Stephanie Ruhle: The dirty little secret is that Americans can afford inflation", "score": "neutral"}, {"title": "Biden to sign bipartisan infrastructure bill into law, authorizing big spending on roads, broadband, EV chargers and more", "score": "positive"}, {"title": "Italian Coffee Roaster Illycaffe Replaces CEO With Eyes on IPO", "score": "neutral"}, {"title": "Biden Appoints Panel of Aides to Oversee Infrastructure Law", "score": "neutral"}, {"title": "Splunk stock on track for worst day in almost a year after CEO exit", "score": "negative"}, {"title": "Key Words: White House calls Kamala Harris a vital partner to President Biden after report of exasperation and dysfunction in the vice presidents office", "score": "neutral"}, {"title": "Tesla Shares Approach Bear Market Territory on Prolonged Selloff", "score": "negative"}, {"title": "Deep Dive: 4 stock picks for the post-pandemic nesting economy from a five-star money manager", "score": "neutral"}, {"title": "Morgan Stanley's Wilson Was 'Wrong' But Still Sees Lower S&P 500 - Bloomberg", "score": "negative"}, {"title": "The Wall Street Journal: Biden and Xi aim to ease tensions during Monday meeting", "score": "positive"}, {"title": "Boris Johnson Warns New U.K. Lockdown Is Possible With NHS Struggling", "score": "neutral"}, {"title": "Washington Fires Coach Jimmy Lake After Less Than 2 Seasons", "score": "neutral"}, {"title": "Thyssenkrupp Pushes Ahead With IPO of $5.7 Billion Hydrogen Unit", "score": "neutral"}, {"title": "GE Aviation Chief Is Open to Acquisitions to Bolster Engine Unit", "score": "neutral"}, {"title": "EU Warns of Serious Consequences If U.K. Scraps NorthernIreland Deal", "score": "negative"}, {"title": "U.S., Allies Weigh Reprisals If Russia Moves Against Ukraine", "score": "negative"}, {"title": "Property Investors Bet $64 Billion on U.S. Homes in Record Buying Spree", "score": "negative"}, {"title": "Nigerian Tech Startup TeamApt Targeting $1 Billion Valuation - Bloomberg", "score": "neutral"}, {"title": "Crypto Miner Marathon to Sell $500 Million of Bonds to Buy More Bitcoin - Bloomberg", "score": "neutral"}, {"title": "Tightest U.S. Job Market Since 1950s Set to Drive Inflation", "score": "negative"}, {"title": "Quicktake Charge Full Show 11/15/2021", "score": "neutral"}, {"title": "Coronavirus Update: Austria locks down its unvaccinated and Netherlands reimposes restrictions, as Europe battles surge in COVID cases", "score": "negative"}, {"title": "Republicans Feel Worse About the Economy Now Than in the Financial Crisis", "score": "neutral"}, {"title": "Financial Crime: Greed over honesty: New York doctor stole $3.7 million in COVID-19 relief money to buy yacht, luxury cars and Rolex watches, prosecutors say", "score": "neutral"}, {"title": "Analysis: Wilson Shut Out for 1st Time on Surprising NFL Day", "score": "neutral"}, {"title": "BNP Paribas Considering Sale of U.S. Unit Bank of the West", "score": "neutral"}, {"title": "Djokovic Beats Ruud At ATP Finals for 6th Straight Win", "score": "neutral"}, {"title": "McLaren Denies Audi Sale Report, Acknowledges Strategic Talks", "score": "neutral"}, {"title": "Bloomberg Quicktake Take Focus Full Show 11/15/21", "score": "neutral"}, {"title": "Crypto: VanEck to launch bitcoin futures ETF on Tuesday, while spot bitcoin ETF remains elusive", "score": "neutral"}, {"title": "Bannon Plea Postponed as Hes Released Without Bail or Passport", "score": "neutral"}, {"title": "Casper Is Going Private in Deal With Bojangles Parent Company", "score": "positive"}, {"title": "London Markets: Royal Dutch Shell and Avasts stocks among the main movers, as Londons bourse trades flat at the start of the week", "score": "negative"}, {"title": "Inflation Fears Could Bring Trump Back to Power, Larry Summers Warns", "score": "neutral"}, {"title": "Nikola Founder Trevor Milton Must Face Criminal Case That He Misled Investors", "score": "negative"}, {"title": "Washington Watch: Build Back Better plan may clear House this week, as White House says bill will combat inflation", "score": "positive"}, {"title": "Amazon Rainforest-Crossing Railway May Be Auctioned Next Year, Brazil Says", "score": "neutral"}, {"title": "NYC Opens Booster Shots to All Adults as Cases Tick Up", "score": "neutral"}, {"title": "What Jim Cramer is watching in the market Monday", "score": "neutral"}, {"title": "Volkswagen Appeals Rejected as High Court Allows Emissions Scandal Suits", "score": "negative"}, {"title": "On Again, Off Again: Johnson & Knaus Relationship Now Solid", "score": "neutral"}, {"title": "This 31-year-old earns $120,000 a year from his TikTok side hustle", "score": "neutral"}, {"title": "Big Short Michael Burry Thinks Elon Musk Just Wants to Sell Tesla", "score": "negative"}, {"title": "Argentina Bonds Climb as President Promises Plan After Vote", "score": "positive"}, {"title": "KBC Buys Raiffeisen Unit in Record $1.2 Billion Bulgarian Deal - Bloomberg", "score": "neutral"}, {"title": "Tesla, Nvidia and Microsoft are 'way ahead of themselves,' trader warns", "score": "negative"}, {"title": "AviAlliance Enters Talks to Sell Budapest Airport to Hungary", "score": "neutral"}, {"title": "Dubai May IPO Emirates, the Airline That Transformed Its Economy", "score": "neutral"}, {"title": "Jeffrey Epstein Faces Trial By Proxy: Ghislaine Maxwell", "score": "negative"}, {"title": ": You can bring this giant 3.4-pound Reese Peanut Butter Cup pie to Thanksgiving this year just 7,680 calories", "score": "neutral"}, {"title": "LA Auto Show Will Boast a Host of Fresh Faces This Year", "score": "neutral"}, {"title": "Metals Stocks: Gold futures see choppy trade to start week, putting 7-session streak at risk", "score": "negative"}, {"title": "Six Flags Abruptly Replaces CEO Even as Park Traffic Recovers", "score": "neutral"}, {"title": "Economic Report: New York Feds Empire State manufacturing business index rebounds in November", "score": "positive"}, {"title": "Federal Reserve Put Itself Between a Rock and a Hard Place", "score": "neutral"}, {"title": "Paying the Price for Refusing Vaccination", "score": "neutral"}, {"title": "Vitol Doubts U.S. Oil Release Would Move Prices: Adipec Update", "score": "neutral"}, {"title": "Vodacom May Consider Listing South Africa Unit to Boost Value", "score": "neutral"}, {"title": "Europe Markets: Philips shares reel after FDA releases findings from Pennsylvania plant inspection", "score": "negative"}, {"title": "Futures Movers: Oil remains under pressure on fears of possible Strategic Petroleum Reserve release", "score": "negative"}, {"title": "Oatly Tumbles After Cutting Sales Forecast on Supply-Chain Snarls - Bloomberg", "score": "negative"}, {"title": "Ex-NBA star Baron Davis' simple money advice for rookies: Invest $25,000 right away", "score": "neutral"}, {"title": "Roblox stock rallies 10% as investor day kicks off", "score": "positive"}, {"title": "Americans are optimistic about their finances and plan to splurge this holiday season, survey finds", "score": "positive"}, {"title": "Quicktake Charge Full Show", "score": "neutral"}, {"title": "Microsoft Opens Three Swedish Data Hubs Using Only Green Power", "score": "positive"}, {"title": "Biden Energy Plan Is 'Prayer' Not Policy, Gas Honcho Souki Says", "score": "neutral"}, {"title": "A mostly Black Alabama county has no municipal sewer service. Can the 1964 Civil Rights Act be used for environmental justice?", "score": "neutral"}, {"title": "Help Me Retire: I want to retire in two years, my wife and I have $3 million saved but were worried about our son with special needs what can we do?", "score": "neutral"}, {"title": "Activision Plummets on Report CEO Knew of Misconduct", "score": "negative"}, {"title": "Stanford Coach Haase Building a Culture for His Team", "score": "neutral"}, {"title": "Times Square New Year's Eve: Hundreds of Thousands of Fully Vaxxed Revelers (With Proof and ID) Invited", "score": "neutral"}, {"title": "U.K. Missing 465,000 People From Workforce Since Covid Hit", "score": "negative"}, {"title": "The Number One: This is Amazons No. 1 business and leadership book of the year", "score": "positive"}, {"title": "You Can Watch the Ball Drop in Times Square This Year, If You're Vaccinated", "score": "neutral"}, {"title": "Why more iconic companies like GE and J&J may be about to get smaller", "score": "neutral"}, {"title": "Billionaire Brockman Shuffles to Court Testimony on His Dementia", "score": "neutral"}, {"title": "NBA Signs Deal to Play Preseason Games in Abu Dhabi", "score": "neutral"}, {"title": "Noah Syndergaard Leaves Mets, Signs Deal With Angels, ESPN Says", "score": "neutral"}, {"title": "Home Depot (HD) Stock Surges, Passes Walmart (WMT) Stock in Market Value", "score": "neutral"}, {"title": "Coronavirus Update: Pfizer and Moderna announce moves to help get vital COVID medicines to low-income countries, and Arkansas joins other states in expanding booster program to all adults", "score": "positive"}, {"title": "Papa John’s launches new restaurant design and logo", "score": "neutral"}, {"title": ": Nvidia pending Arm merger faces heightened regulatory scrutiny as competitive concerns mount", "score": "negative"}, {"title": "That's What Oligarchs Do Credit Suisse Says in Trial Defense", "score": "neutral"}, {"title": "Fed Bullard Urges More Hawkish Policy to Offset Inflation Rise", "score": "positive"}, {"title": "Condo Sales Are Soaring All Over Manhattan -- Except Midtown", "score": "neutral"}, {"title": "In One Chart: Bitcoin as a universal payment method? This Deutsche Bank chart shows one big thing standing in the way.", "score": "neutral"}, {"title": "Economic Report: Home builders are growing more confident as Americans demand more housing", "score": "neutral"}, {"title": "We see new highs ahead for Disney shares and are buying more", "score": "positive"}, {"title": "J&J, Age 135, Seeks Influencers to Give Band-Aids Youth Appeal", "score": "neutral"}, {"title": "Seasonality points to a quiet stretch for markets. Here where to find opportunity in the calm", "score": "positive"}, {"title": "3 things student loan borrowers should know before the end of the year", "score": "neutral"}, {"title": "Barclays Hires Wells Fargo's Jefferson Rives for Health-Care Group", "score": "neutral"}, {"title": "Amazon (AMZN) Nixes Jersey City Office Deal With Landlord Mack-Cali (CLI)", "score": "neutral"}, {"title": "What Jim Cramer is watching in the market Tuesday", "score": "neutral"}, {"title": "Current Inflation Rate Set to Spoil Holiday Season for Struggling Families", "score": "negative"}, {"title": "Rivian Leaps Past Volkswagen's Valuation as EV Mania Rages", "score": "neutral"}, {"title": "Two Duke Basketball Players Face DWI Charges After Arrest", "score": "neutral"}, {"title": "Pentagon Contracting Waste Is So Easy to Exaggerate", "score": "neutral"}, {"title": "Economic Report: U.S. industrial output surges in October after stumbling in prior month", "score": "positive"}, {"title": "Rivian shares soar again in post-IPO rally", "score": "positive"}, {"title": "Fuente Out After 6 Seasons as Virginia Tech Head Coach", "score": "neutral"}, {"title": "The Fed: Federal Reserve should tack in a more hawkish direction", "score": "positive"}, {"title": "SoFi stock falls after company announces secondary offering by some of its shareholders", "score": "negative"}, {"title": "Transcript: ASML, the Obscure Powerhouse at the Cutting Edge of Chip Technology", "score": "neutral"}, {"title": "Green Hydrogen Could Compete With Gray in a Decade, Engie Says", "score": "neutral"}, {"title": "Harvard epidemiologist: One dose of Covid vaccine is 'an incredible safeguard' for kids before the holidays", "score": "neutral"}, {"title": "Disinformation is stifling conversation about climate change, new research says these 4 tips can help", "score": "neutral"}, {"title": "Why SoulCycle's CEO accepted the job on the heels of a company controversy: 'I'm not afraid of a challenge'", "score": "neutral"}, {"title": "Nvidia's Arm Deal Faces U.K. National Security Probe", "score": "negative"}, {"title": "Amazon Brand Owner Heyday Raises $555 Million in Funding Round", "score": "positive"}, {"title": "U.S. shale has a message for the Biden administration: Ask us to increase oil production, not OPEC", "score": "negative"}, {"title": "Oaktree Capital Raises $16 Billion for Opportunistic Credit Fund", "score": "neutral"}, {"title": "Italy and France to Sign Treaty to Show Closeness Post-Merkel", "score": "neutral"}, {"title": "Economic Report: U.S. retail sales jump, but high inflation plays role", "score": "negative"}, {"title": "Know before the stock market opens Tuesday", "score": "neutral"}, {"title": "Elder Care on Pace for Record Investment in Canada Post-Covid", "score": "neutral"}, {"title": "Indians Settle Lawsuit With Guardians Roller Derby Team", "score": "neutral"}, {"title": "France, U.S. Relations Moving in Good Direction, Minister Says", "score": "positive"}, {"title": "The Electric Vehicle Invasion Is Already Here", "score": "positive"}, {"title": "Futures Movers: Oil edges higher as investors shake off SPR threat", "score": "positive"}, {"title": "Cheval Blanc Paris Hotel: Inside LVMH's Luxury Disneyworld", "score": "neutral"}, {"title": "Metals Stocks: Gold futures pop higher as traders watch for U.S. data", "score": "positive"}, {"title": "Spain's Basque Region to Limit Large Crowds as Infections Rise", "score": "neutral"}, {"title": "Billionaire Clan From Brazil Heads to New York in Hunt for Deals", "score": "neutral"}, {"title": "Why airlines struggle to stay profitable", "score": "neutral"}, {"title": "BMW CFO Sees Full-Year Earnings at Higher End of Guidance", "score": "positive"}, {"title": "UniCredit Set to Slash Jobs in Hubs From New York to Tokyo", "score": "negative"}, {"title": "Peloton to Offer $1 Billion in Shares Following Selloff", "score": "neutral"}, {"title": "Greenspan's Bond Yield Conundrum Has Returned to Haunt Markets", "score": "neutral"}, {"title": "Pfizer Moves to Allow Cheap Versions of Promising Covid Pill", "score": "positive"}, {"title": "Resurgent oil supply expected to soothe tight market", "score": "positive"}, {"title": "IEA's Oil Refining Data Offer a Less-Bearish Take on the Market", "score": "positive"}, {"title": "The Gulf Between Hospitals and the Public", "score": "neutral"}, {"title": "Brett Arends's ROI: Can Social Security afford all this federal spending?", "score": "neutral"}, {"title": "Container Shipping Rates May Take Two Years to Fall to Normal", "score": "negative"}, {"title": "Bond Report: Treasury yields move lower ahead of U.S. retail sales data", "score": "negative"}, {"title": "One European Country's Job Market Just Turned 'Extremely Hot'", "score": "neutral"}, {"title": "Need to Know: Here’s why tech could be the sweet spot for next year, but this hot sector is a no, says Wells Fargo", "score": "neutral"}, {"title": "World Trade Arbiter Gets Big Chance to Break Deals Drought", "score": "neutral"}, {"title": "NetEase's Music App Cloud Village Revives Delayed Hong Kong IPO", "score": "neutral"}, {"title": "Guanyu Zhou joins Alfa Romeo: F1 team-mate confirmed for Valtteri Bottas as Antonio Giovinazzi leaves", "score": "neutral"}, {"title": "Fortnite Gives Up on China, Following LinkedIn and Yahoo", "score": "neutral"}, {"title": "The K-wave Has Been Years In The Making", "score": "neutral"}, {"title": "The pandemic strongly affects the market", "score": "negative"}, {"title": "This fund company was an early believer in Tesla it now making these bets", "score": "neutral"}, {"title": "The Fed: Fed Williams defends central bank new average inflation targeting policy from criticism", "score": "positive"}, {"title": "A socialist manifesto for American financial services: Republicans blast Biden bank-regulator pick Omarova at fiery hearing", "score": "neutral"}, {"title": "Balyasny Bans Hiring Staff From Ken Griffin Citadel Fixed Income Unit", "score": "neutral"}, {"title": "The Ratings Game: Activision Blizzard stock downgraded as misconduct charges bring a significant amount of uncertainty", "score": "neutral"}, {"title": "Biden Bank Watchdog Nominee Counters GOP Claims of Radical Leanings", "score": "neutral"}, {"title": "The big management mistake AT&T made after acquisition, according to former Time Warner CEO", "score": "negative"}, {"title": "IRS Sees Crypto Seizures Worth Billions of Dollars Next Year", "score": "negative"}, {"title": "Coronavirus Update: Face masks and distancing are most effective measures in reducing COVID-19 spread, study finds, as experts clamor for U.S. to expand booster program", "score": "neutral"}, {"title": "Robinhood, Citadel Win Dismissal of Meme-Stock Lawsuit", "score": "neutral"}, {"title": "Biden's Remedy for High Gasoline Prices: Blame Oil Companies", "score": "negative"}, {"title": "Israeli Defense Minister Cleaner Charged With Spying for Iran", "score": "negative"}, {"title": "How a 25-year-old with a disability lives on $33,000 in Chicago: 'People don't realize how expensive it is to be disabled'", "score": "neutral"}, {"title": "Portillo's Hikes Menu Prices on Surging Labor, Commodity Costs", "score": "negative"}, {"title": "Want to live in your home for the rest of your years? Here what it takes", "score": "neutral"}, {"title": "Wine fanatics beware: Supply chain problems put the squeeze on this year's eagerly awaited Beaujolais Nouveau haul", "score": "neutral"}, {"title": "Sen. Elizabeth Warren calls on SEC to investigate Trump SPAC deal", "score": "neutral"}, {"title": "Grammarly Is Now the 10th Most Valuable U.S. Startup", "score": "positive"}, {"title": "London Markets: Royal Mail, Persimmon buck otherwise weak FTSE 100", "score": "neutral"}, {"title": "Shell's New Emission Targets Fall Short, Activist Investor Says", "score": "neutral"}, {"title": "South Africa Ramaphosa Chips In to Fund His Cash-Strapped ANC", "score": "neutral"}, {"title": "Sheree McLaughlin, Girlfriend in House of Gucci Murder Drama, Speaks Out", "score": "neutral"}, {"title": "Kamala Harris Pushes Back Against Reports of West Wing Tensions", "score": "positive"}, {"title": "Surveillance: Growth Trajectory With Rajappa (Podcast)", "score": "neutral"}, {"title": "Cannabis Watch: Poseidon launches new cannabis ETF on the NYSE", "score": "neutral"}, {"title": "IBM Arbitration Gag Rules Are Illegal, Fired Workers Say", "score": "negative"}, {"title": "Africa's Biggest Pension Fund Freezes $4.5 Billion Mandate", "score": "neutral"}, {"title": "Insurers Balk at Paying for Biogen's $56,000-a-Year Alzheimer's Treatment", "score": "negative"}, {"title": "The real key to ending the Great Resignation is focusing on 'enthusiastic stayers'", "score": "neutral"}, {"title": "What Are Day Traders Thinking? S&P's Twitter Sentiment Index Has Answer", "score": "neutral"}, {"title": ": Mortgage rates surge higher as inflationary pressures grow", "score": "negative"}, {"title": "Insurers Balk at Paying for Biogen's $56,000-a-Year Alzheimer's Treatment", "score": "negative"}, {"title": "Lawmakers introduce bipartisan bill to address crypto tax reporting requirement", "score": "neutral"}, {"title": "Poland Says Humanitarian Corridor for Migrants May Backfire", "score": "negative"}, {"title": "The Ratings Game: Nvidia stock rockets more than 10% on stellar earnings, on track for new record", "score": "positive"}, {"title": "U.S. Warns Pilots to Be Wary of Military Fire in Ethiopian Airspace", "score": "neutral"}, {"title": ": You have to say I do before I quit, according to this analysis of the jobs market", "score": "neutral"}, {"title": "Electric Vehicles Rank Low in Consumer Reports Reliability Study", "score": "negative"}, {"title": "Bloomberg Westminster: Vote of Confidence", "score": "neutral"}, {"title": "South Africa Raises Key Rate for First Time in Three Years", "score": "negative"}, {"title": "Starbucks and Amazon Go collaborate for the launch of a New York City store", "score": "positive"}, {"title": "Kenya's Biggest Bank Plans Nation's First Green Bond by a Lender", "score": "neutral"}, {"title": "Extra Credit: Do AI-powered lending algorithms silently discriminate? This initiative aims to find out", "score": "neutral"}, {"title": "This is how Nvidia plans to make lots of money from the metaverse", "score": "positive"}, {"title": "What Jim Cramer is watching in the market Thursday, including the next $1 trillion stock", "score": "neutral"}, {"title": "NBA star Kevin Love on finding success while struggling with mental health: 'You can't achieve yourself out of depression'", "score": "neutral"}, {"title": "CVS Will Close 300 Stores Annually Over 3 Years, Create New Formats", "score": "neutral"}, {"title": "Macy's Hires Advisers to Look at Digital Business as Activist Seeks Spinoff", "score": "positive"}, {"title": "De Blasio Pitches Free Year-Round Schooling in New York State", "score": "neutral"}, {"title": "Bloomberg technology increasingly catering for multi-asset buy-side", "score": "positive"}, {"title": "Putin Says Russia Must Keep U.S., Allies on Edge Over Ukraine", "score": "negative"}, {"title": "What Happened to MDC Energy? A Lesson From Permian Basin Oil Company", "score": "neutral"}, {"title": "Why Can't Some Covid-19 Vaccinated People Travel to the United States?", "score": "neutral"}, {"title": "Inflation Spreads to Online Retail, Once a Haven of Discounts", "score": "negative"}, {"title": "Economic Report: Philadelphia Fed manufacturing index surges to 7-month high despite rising inflation", "score": "positive"}, {"title": "The Ratings Game: GoPro stock rallies after J.P. Morgan cheers subscriber momentum in upgrade", "score": "positive"}, {"title": "Poland Has Half a Million People in Quarantine as Covid Rages On", "score": "negative"}, {"title": "What Nord Stream 2 Needs to Get Regulatory Approval: QuickTake", "score": "neutral"}, {"title": "Economic Report: Jobless claims drop to pandemic low of 268,000 as labor shortage forces businesses to avert layoffs", "score": "positive"}, {"title": "This is how Americas booming demand for goods shattered the supply chain", "score": "neutral"}, {"title": "Farming Software Maker Valued at $4 Billion in Round", "score": "neutral"}, {"title": "Ford Explores Buying Chips Directly from GlobalFoundries to Offset Shortage", "score": "neutral"}, {"title": "Muguruza Wins WTA Finals for First Time, Beating Kontaveit", "score": "neutral"}, {"title": "Metals Stocks: Gold pulls back from highest settlement since June", "score": "neutral"}, {"title": "Li Ka-shing-Backed Dutch Waste Firm AVR in Talks to Buy AEB", "score": "neutral"}, {"title": "Macy's Rallies After Forecasting a Surge in Year-End Sales", "score": "positive"}, {"title": "5 things to know before the stock market opens Thursday", "score": "neutral"}, {"title": "Ex-Judge Seeks to Bridge Brazil Right-Left Rift in 2022 Vote", "score": "neutral"}, {"title": "Kabanga Says Tanzania Mine May Answer Elon Musk's Nickel Plea", "score": "neutral"}, {"title": "Czechs and Slovaks Join European Crackdown on the Unvaccinated", "score": "positive"}, {"title": "JPMorgan Ex-Brokers Fight Grandma in Court, Seeking Her Silence", "score": "negative"}, {"title": "Stocks making the biggest moves premarket: Alibaba, JD.com, Cisco, Nvidia and more", "score": "neutral"}, {"title": "Futures Movers: Oil prices slump to 6-week low as U.S. reportedly presses for coordinated release of crude reserves", "score": "negative"}, {"title": "S&P 500 Will Struggle to Repeat 2021's Rally - Bloomberg", "score": "positive"}, {"title": "Europe Chip Subsidies Will Face Tough Scrutiny, Vestager Warns", "score": "negative"}, {"title": "If Biden picks Brainard over Powell for Fed chief, expect an immediate market impact", "score": "neutral"}, {"title": "Space Junk Spreads, Creating Risk of No-Go Zones for Satellites...", "score": "negative"}, {"title": "Best Buy Founder Discusses State of Entrepreneurship (Podcast)", "score": "neutral"}, {"title": "Hank Paulson Has a Warning for Washington and Beijing", "score": "neutral"}, {"title": "Satire Tells the Real Business of Solar", "score": "neutral"}, {"title": "Northern Ireland Dispute Adds to Pressure on BOE: Beyond Brexit", "score": "negative"}, {"title": "Asia's Early Covid Rockstar Hits a Rough Patch", "score": "neutral"}, {"title": "Kohl's (KSS) Stock Soars After Retailer Reports Sales Up 15%", "score": "positive"}, {"title": "Bond Report: U.S. Treasury yields edge lower ahead of weekly jobless benefit claims data", "score": "negative"}, {"title": "Buy $28,000 in Furnishings to Rent in World's Craziest Market...", "score": "neutral"}, {"title": "Need to Know: Record selling by insiders is setting up stocks for a big fall, says contrarian investor", "score": "neutral"}, {"title": "Brett Arends's ROI: Coming soon to Fidelity 401(k) plans: Annuities", "score": "neutral"}, {"title": "U.S. to Pay Pfizer $5.3 Billion for Order of Covid Therapy Pill", "score": "positive"}, {"title": "Jack Ma's Ant Group Sees Profit Rise 39% on Investments", "score": "positive"}, {"title": "France Attal Says Fishermen Need Support as U.K. Talks Drag On", "score": "neutral"}, {"title": "Manchester United Fires Manager Ole Gunnar Solskjaer", "score": "neutral"}, {"title": "Poland Morawiecki Sees Synchronized Crises Around Belarus", "score": "negative"}, {"title": "Palestinian Kills 1, Injures 4 Before Police Shoot Him Dead", "score": "negative"}, {"title": "Javid Says Plan B Not Needed, Confirms Racial Bias Probe", "score": "neutral"}, {"title": "Samsung to Announce U.S. Chip Plant Location This Week", "score": "neutral"}, {"title": "South African Minister Says Eskom Delaying Projects: City Press", "score": "neutral"}, {"title": "Malaysia Sees Little Impact From EU Deforestation Curbs", "score": "neutral"}, {"title": "Iran's Mahan Air Says It Foiled Cyber Attack on Systems", "score": "neutral"}, {"title": "Saudi Stocks Extend Slide as Oil Weighs on Sentiment: Inside EM", "score": "negative"}, {"title": "G42 (Mubadala) Driverless Car Service: Yas Island News", "score": "neutral"}, {"title": "Approval Sought for First Abortion Pill in Japan, Yomiuri Says", "score": "neutral"}, {"title": "MeDIA eYe NFT Portal - Successfully Completes Its Public Launch of Eye Token", "score": "neutral"}, {"title": "Sudan Army Reaches Deal to Return Premier Hamdok to Office", "score": "neutral"}, {"title": "El Salvador Plans $1B in Tokenized Bitcoin Bonds, President Bukele Says (BTC)", "score": "positive"}, {"title": "Saudi Stock Exchange Seeks to Raise as Much as $1 Billion in IPO", "score": "positive"}, {"title": "The $5 Billion Hoard of Metal the World Wants But Can't Have", "score": "neutral"}, {"title": "China Downgrades Lithuania Ties Over Taiwan Office", "score": "negative"}, {"title": "Japan Foreign Minister Hayashi Says Wang Yi Invited Him to China", "score": "neutral"}, {"title": "At Alcatraz Island, Haaland Highlights Indigenous Progress", "score": "neutral"}, {"title": "Venezuelan Musicians Set World's Largest Orchestra Record - Bloomberg", "score": "neutral"}, {"title": "Chinese Experts Arrive in Hong Kong to Review Covid Measures", "score": "positive"}, {"title": "Accidental Gun Discharge Creates Chaos At Atlanta Airport", "score": "negative"}, {"title": "Garcetti Expects L.A. to Get Billions in Infrastructure Funds", "score": "positive"}, {"title": "Flights briefly halted after accidental gun discharge at Atlanta airport, no injuries reported", "score": "negative"}, {"title": "Texas Democrat Johnson Says She Leaving House After 30 Years", "score": "neutral"}, {"title": "Kissinger Doesnt See China Invasion of Taiwan in Next Decade", "score": "neutral"}, {"title": "Theranos' Balwani Wants Marxist Vanity Plate Out of His Trial", "score": "neutral"}, {"title": "Democrat Eddie Bernice Johnson Ending Decades in Congress", "score": "neutral"}, {"title": "Mutual Funds Weekly: These money and investing tips can help your portfolio traverse the stock market peaks and valleys", "score": "neutral"}, {"title": "Ferrari Pays Homage to 1960s Race Cars With Slickest Model Yet", "score": "neutral"}, {"title": "Colombia Financial Regulator Approves Takeover Bid for Nutresa", "score": "neutral"}, {"title": "Protesters Throng Vienna to Decry Lockdown, Vaccine Mandate", "score": "negative"}, {"title": "Europe Protests", "score": "negative"}, {"title": "Kellogg and Cereal Workers Union Set to Resume Talks on Monday", "score": "neutral"}, {"title": "France Pledges $2.2 Billion to Bolster Appeal for Tourists", "score": "positive"}, {"title": "Coin Worth $0.00004893 Highlights Crypto's Wild Decimal Frontier", "score": "neutral"}, {"title": "With Lights Back On, Times Square Hopes to Regain Its Luster", "score": "neutral"}, {"title": "Najib Leads Party to Win Malaysia Local Polls After 1MDB Fracas", "score": "neutral"}, {"title": "Inside Mark Zuckerberg's metaverse, how will the world of advertisements look?", "score": "neutral"}, {"title": "Stock Bubble", "score": "negative"}, {"title": "Wind turbine maker Vestas shuts some computer  systems after cyber security incident", "score": "negative"}, {"title": "Americans Load Up on Firewood as Home-Heating Costs Skyrocket", "score": "negative"}, {"title": "Take a look inside Firefly Space, as the rocket builder prepares for a second orbital launch attempt", "score": "neutral"}, {"title": "Falling real yields are a key to the stock-market rally", "score": "negative"}, {"title": "UBS, Deutsche Bank Set the Course for Next Era With New Chairmen", "score": "neutral"}, {"title": "Denmark Is More Resilient Than the U.S. and Germany Because of Trust", "score": "neutral"}, {"title": "SoftBank-Backed Ola Plans to Roll Out EV Test Rides Across India", "score": "neutral"}, {"title": "Rocket builder Astra reaches orbit for the first time", "score": "positive"}, {"title": "World Fish Stocks Are in Worse State Than Expected, Study Shows", "score": "negative"}, {"title": "Biden Faces Tougher Sell to Manchin as Coal Hits 12-Year High", "score": "negative"}, {"title": "The Pandemic Is Roaring Back With a Vengeance", "score": "negative"}, {"title": "Wall Street Can't Handle Inflation", "score": "negative"}, {"title": "Fed Looks Likely to Consider Faster Drawdown in Asset Purchases", "score": "negative"}, {"title": "British Business Bank Failed on Scrutiny", "score": "negative"}, {"title": "Virgin Atlantic in Talks for $540 Million Funding", "score": "positive"}, {"title": "Vestas Shuts Down Some IT Systems After Cyber Security Incident", "score": "negative"}, {"title": "Get Used to Expensive Coffee. And It'll Probably Taste Worse Too", "score": "neutral"}, {"title": "Approves Sinovac Vaccine for Children Ages 3-17", "score": "positive"}, {"title": "Singapore's Covid Cases Stabilize Ahead of Curbs Deadline", "score": "positive"}, {"title": "Wildfire Threat Returns to California Ahead of Thanksgiving", "score": "negative"}, {"title": "Covid market scares are buying opportunities", "score": "positive"}, {"title": "Good financial report allowed the company to attract new investors", "score": "positive"}, {"title": "Number of people infected with coronavirus is increasing dramatically", "score": "negative"}, {"title": "Inflation in the US threatens the growth of stock markets", "score": "negative"}, {"title": "South Africa Punished for Wrong Reasons Over Covid Variant", "score": "negative"}, {"title": "Markets Fall As Black Friday Shopping Begins", "score": "negative"}, {"title": "The Threat of The New COVID-19 Variant", "score": "negative"}, {"title": "Covid Rising Rapidly in Two Major S. Africa Cities, Council Says", "score": "negative"}, {"title": "Philippines Stops South Africa Flights Over Variant Worries", "score": "negative"}, {"title": "Canada Restricts Travel From Southern Africa on Covid Variant", "score": "negative"}, {"title": "Dutch Find 13 Omicron Cases Among Passengers From South Africa", "score": "negative"}, {"title": "13 Cases of Omicron Variant in Dutch Testing of Travelers", "score": "negative"}, {"title": "Magnitude-7.5 Earthquake Strikes Northern Peru", "score": "negative"}, {"title": "Moderna Says New Vaccine for Omicron May Be Ready in Early 2022", "score": "positive"}, {"title": "Why Job Openings Are Surging (Podcast)", "score": "negative"}, {"title": "Apple Car, VR Headset Launch Plan; Belkin Boost Charge Pro Review - Bloomberg", "score": "positive"}, {"title": "Commodities Corner: OPEC+ at a crossroads as oil prices post worst monthly drop since the pandemic began", "score": "negative"}, {"title": "We're buying the dip on Morgan Stanley as the market sells off", "score": "positive"}, {"title": "The Ratings Game: AT&T leads wireless stocks lower after company reinforced market fears about the cost of growth", "score": "negative"}, {"title": "The Fed: Powell open to discussing faster taper of asset purchases", "score": "negative"}, {"title": "Oxford Sees No Evidence Omicron Defeats Covid Vaccines So Far", "score": "negative"}, {"title": ": Oil prices drop 4% on worries over vaccine effectiveness against omicron variant", "score": "negative"}, {"title": "Market Snapshot: 10-year Treasury yield slides back below 1.50% on revived omicron fears", "score": "negative"}, {"title": "Brazil Unemployment Falls More Than Expected on Slow Recovery", "score": "negative"}, {"title": "Omicron Clouds the Outlook", "score": "negative"}, {"title": "Norway Tightens Rules on Isolation, Advises Return to Face Masks", "score": "negative"}, {"title": "Kelley Blue Book: More car shoppers are thinking about EVs, but still holding back", "score": "neutral"}, {"title": ": First case of omicron variant in the U.S. is in a San Francisco resident returning from South Africa, health officials confirm", "score": "negative"}, {"title": "Omicron Variant Found in U.S.; First Case ID'd in California", "score": "negative"}, {"title": "Pfizer Vaccine Wins Approval in Italy for Kids Aged 5-11", "score": "positive"}, {"title": "South African Scientists Sound Caution on Omicron Case Severity", "score": "negative"}, {"title": "U.S. confirms nation's first case of omicron Covid variant in California", "score": "negative"}, {"title": "WHO says omicron has been found in 23 countries across the world", "score": "negative"}, {"title": "The Margin: How to watch the Rockefeller Center Christmas Tree Lighting for free", "score": "neutral"}, {"title": ": Costco saw inflation easing as November sales rose", "score": "positive"}, {"title": "U.S. Plans to Tighten Travel Rules Over Omicron Threat", "score": "negative"}, {"title": "Earnings Results: CrowdStrike stock rises on earnings beat, outlook hike", "score": "positive"}, {"title": "Jack Dorsey's Square (SQ) Changes Name to Block - Bloomberg", "score": "neutral"}, {"title": ": Snowflake stock soars after software sales more than double", "score": "positive"}, {"title": "Earnings Results: Splunk stock drops as revenue, forecast fall short of Wall Street view", "score": "negative"}, {"title": "This 32-year-old has spent over $125,000 on NFTs to display in the metaverse", "score": "neutral"}, {"title": "Omicron Lands in U.S. With Hospitals Still Battered by Covid", "score": "negative"}, {"title": "Omicron Accelerates Push for Second-Generation Covid Vaccines", "score": "positive"}, {"title": "Germany Explores Lockdown for the Unvaccinated With Covid Surging", "score": "negative"}, {"title": "Germany Imposes Strict Curbs on Unvaccinated to Stem Covid", "score": "negative"}, {"title": "Large Omicron Outbreak in Norway Linked to Corporate Christmas Party", "score": "negative"}, {"title": "Economic Report: Jobless claims climb 28,000 to 222,000 in Thanksgiving week", "score": "negative"}, {"title": "Omicron Variant Threat Exacerbates Joe Biden's Challenges", "score": "negative"}, {"title": "Metals Stocks: Gold prices softer as investors continue to monitor omicron variant", "score": "negative"}, {"title": ": The omicron panic is overdone. Buy the dips in these stocks, says JPMorgan.", "score": "positive"}, {"title": "Omicron Stokes Winter of Discontent for Biden", "score": "negative"}, {"title": "South Africa Economic Hub Has Fully Vaccinated 33% of Its Adults", "score": "positive"}, {"title": "U.S. Warns of Consequences as Russia Cites Ukraine War Risk", "score": "negative"}, {"title": "Activision Blizzard Inc. stock falls Wednesday, underperforms market", "score": "negative"}, {"title": "Activision: Sentiment Shifts May Present A Buying Opportunity", "score": "positive"}, {"title": "Activision Blizzard Inc. stock falls Monday, underperforms market", "score": "negative"}, {"title": "Activision CEO Would Consider Leaving If Cant Fix Culture: DJ", "score": "negative"}, {"title": "Activision Blizzard: Stock Looks Cheap after Vicious Decline", "score": "positive"}, {"title": "Microsoft Pressures Activision Blizzard", "score": "negative"}, {"title": "Activision may become vulnerable to a takeover", "score": "negative"}, {"title": "Why Activision Blizzard Shares Are Falling", "score": "neutral"}, {"title": "What's Next For Activision Blizzard Stock?", "score": "neutral"}, {"title": "Activision Blizzard Inc. stock rises Friday, outperforms market", "score": "positive"}, {"title": "Activision Blizzard Down Over 14%, on Pace for Largest Percent Decrease Since November 2008 -- Data Talk", "score": "negative"}, {"title": "Activision Blizzard fires 20 employees following harassment claims - FT", "score": "negative"}, {"title": "Alibaba Reaches New Lows: Now What?", "score": "negative"}, {"title": "Alibaba's Market Cap Has More Than Halved Since Ant IPO Debacle", "score": "negative"}, {"title": "The Omicron variant and the stock market: Morning Brief", "score": "neutral"}, {"title": "Didi reportedly told to delist from NYSE by Chinese regulators", "score": "negative"}, {"title": "Alibaba: Big Investors Are Fleeing", "score": "negative"}, {"title": "Chinese Regulators Penalize Alibaba for Past Deal", "score": "negative"}, {"title": "Alibaba (BABA) Q2 Earnings Miss Estimates, Revenues Rise Y/Y", "score": "negative"}, {"title": "Alibaba Tumbles on Weak Earnings Report: ETFs in Focus", "score": "negative"}, {"title": "Alibaba: Weak Quarterly Results, But Accelerated Buyback Is Bullish", "score": "neutral"}, {"title": "Alibaba (NYSE:BABA) is still Attractively Valued but Risks are Increasing", "score": "neutral"}, {"title": "Analysts Slash Price Targets On Alibaba On Dismal Q2 Performance, Outlook", "score": "negative"}, {"title": "Alibaba Share Price Tumbles After Earnings Miss", "score": "negative"}, {"title": "Alibaba Ramps Up Ride-Hailing Investment Amid Regulatory Crackdown", "score": "positive"}, {"title": "Alibaba Crashes In Hong Kong After Weak Earnings Report, Rival JD Strikes Gains; EV Stocks Xpeng, Li Auto Plunge Too", "score": "negative"}, {"title": "Chinese livestreamers can rake in billions of dollars in hours. How long will it last?", "score": "neutral"}, {"title": "Alibaba Stock: A Safe Growth Play", "score": "positive"}, {"title": "Alibaba sees slowest sales growth ever during this year's Singles' Day sale", "score": "negative"}, {"title": "9 Dividend Stocks to Buy According to Marc Majzner Clearline Capital", "score": "neutral"}, {"title": "Wall Street Breakfast: The Week Ahead (Podcast)", "score": "neutral"}, {"title": "The Fed: Fed may have to end bond-buying stimulus strategy in early spring, Bostic says", "score": "negative"}, {"title": "Zimbabwe Finds First Omicron Case After Announcing Quarantine", "score": "negative"}, {"title": "Apple Warns Of Slowing iPhone Demand (Radio)", "score": "negative"}, {"title": "Surveillance: $150 Oil With JPMorgan's Malek (Podcast)", "score": "neutral"}, {"title": "JPMorgan Banker Takes Leave to Help French Far Right Candidate", "score": "neutral"}, {"title": "PNM Plunges After Regulators Criticize Avangrid Takeover", "score": "negative"}, {"title": ": Nearly half of Americans say inflation has caused them financial hardship", "score": "negative"}, {"title": "British Tycoon Barclay Faces Prison for Failing to Pay Ex-Wife", "score": "neutral"}, {"title": ": Stressed about market volatility and want to change your investments? Do these 5 tasks instead", "score": "neutral"}, {"title": "The Latest On Infrastructure And Markets (Podcast)", "score": "neutral"}, {"title": "Examining Market Corrections (Radio)", "score": "neutral"}, {"title": "NASA awards Blue Origin, Northrop Grumman and Nanoracks with contracts to build private space stations", "score": "positive"}, {"title": "Apple Tells Suppliers IPhone Demand Slowing (Audio)", "score": "negative"}, {"title": "QuickTake \"Stock\" Full Show 12/02/21", "score": "neutral"}, {"title": "U.S. Regulators Move Step Closer to Delisting Chinese Firms", "score": "negative"}, {"title": "Economic Report: U.S. seen adding almost 600,000 jobs in November, but labor shortage persists", "score": "neutral"}, {"title": "The Fed: Fed dot-plot likely to show more than one interest rate hike in 2022, Daly says", "score": "neutral"}, {"title": "Omicron Continues To Spread (Podcast)", "score": "negative"}, {"title": "U.S. Employment Surveys Diverge, Showing Mixed Labor Recovery", "score": "positive"}, {"title": "Lithuania Appeals to EU as China Feud Expands to Trade Dispute", "score": "negative"}, {"title": "Omicron Scare Haunts 53,000 NYC Anime Convention Attendees", "score": "negative"}, {"title": "S&P 500 Slumps as Mixed Jobs Report Fails to Soothe Nerves", "score": "negative"}, {"title": "Economic Report: A huge part of the U.S. economy grew in November at a record pace, ISM finds", "score": "positive"}, {"title": "Economic Report: Factory orders jump 1% in October", "score": "positive"}, {"title": "Treasury Yields Climb as Jobs Report Leaves Fed Outlook Intact", "score": "positive"}, {"title": "Metaverse Coins Surpass Bitcoin Gains This Year, Macro Hive Says", "score": "neutral"}, {"title": "What Jim Cramer is watching in the market Friday, including the latest pandemic stock disaster", "score": "neutral"}, {"title": "These 3 omicron questions can help you keep or cancel your holiday travel plans", "score": "neutral"}, {"title": "Fed Seen on Track for Faster Bond Tapering Despite Jobs Numbers", "score": "negative"}, {"title": "Belgium Extends School Holiday in Attempt to Break Virus Wave", "score": "negative"}, {"title": "11 great gifts under $25 for everyone on your list", "score": "neutral"}, {"title": "How Layer 2 Blockchain Tech Can Ease Ethereum's Woes on Speed, Cost (ETH) - Bloomberg", "score": "neutral"}, {"title": "5 things to know before the stock market opens Friday", "score": "neutral"}, {"title": "Bond Report: Treasury yields slip as investors await Friday jobs report", "score": "negative"}, {"title": "Economic Report: Coming up: U.S. jobs report for November", "score": "neutral"}, {"title": "BioNTech Says Modifying Vaccine May Increase Omicron Immunity", "score": "positive"}, {"title": "Two Bouts of Covid in Seven Months", "score": "neutral"}, {"title": "The Wall Street Journal: Omicron worries lead to vaccine demand spike at Walgreens, CVS pharmacies", "score": "positive"}, {"title": "What's Next for Amazon's Most Profitable Business", "score": "neutral"}, {"title": "Bloomberg Daybreak: December 3, 2021 - Hour 1 (Radio)", "score": "neutral"}, {"title": "Businesses Caught in U.S.-China Crossfire", "score": "neutral"}, {"title": "Germany Faces 'Long Road Ahead' in Covid Battle, Expert Warns", "score": "neutral"}, {"title": "Don't buy Uber just yet, traders say after UBS names it top pick in ride-hailing", "score": "neutral"}, {"title": ": Nio, Alibaba lead losses for U.S.-listed stocks of Chinese companies after Didi delisting news", "score": "negative"}, {"title": ": Adobe stock stumbles toward worst day in 20 months as DocuSign fears spark knee-jerk reaction", "score": "negative"}, {"title": "Balance of Power: November's Odd Jobs Report (Radio)", "score": "neutral"}, {"title": "Market Extra: ARK Innovation fund falls to lowest level in over a year as Nasdaq Composite sinks toward correction", "score": "negative"}, {"title": "Retirement Weekly: The best reason of all to postpone retirement", "score": "neutral"}, {"title": "Balance of Power: Shutdown Averted (Radio)", "score": "neutral"}, {"title": "Retirement Weekly: Spread the love and 3 other things new investors need to know", "score": "neutral"}, {"title": "Raspy-Voiced Biden Diagnosed With Congestion, Frog in Throat", "score": "neutral"}, {"title": "QuickTake Stock Full Show 12/03/21", "score": "neutral"}, {"title": "Covid Cases Continue to Rise (Podcast)", "score": "negative"}, {"title": ": Biden plan for free and easy at-home COVID-19 tests may not be as simple as it sounds. Like everything we do in health care in America, we make it complicated", "score": "positive"}, {"title": "The Ratings Game: Nvidia stock slides into correction territory after FTC sues to halt Arm deal", "score": "negative"}, {"title": "Goldman Cuts Forecast", "score": "negative"}, {"title": "Goldman Cuts Forecast", "score": "negative"}, {"title": "Omicron Is Drag on Growth economic", "score": "negative"}, {"title": "Bitcoin down  more than", "score": "neutral"}, {"title": "Bitcoin Grows on the rise of Wall Street", "score": "neutral"}, {"title": "Strong sell-off of Chinese stocks on the market on Friday", "score": "negative"}, {"title": "After the OPEC deal, the stock market shows oil growth", "score": "negative"}, {"title": "US stocks are heading for growth, but the virus is hindering them", "score": "neutral"}, {"title": "Georgia 'downs two Russian warplanes' as countries move to brink of war", "score": "negative"}, {"title": "'150 Russian tanks have entered South Ossetia whilst Georgia shoots down two Russian jets.'", "score": "negative"}, {"title": "'150 Russian tanks have entered South Ossetia whilst Georgia shoots down two Russian jets.'", "score": "negative"}, {"title": "'War Nerd - Ossetia: all over but the whining'", "score": "neutral"}, {"title": "Georgia 'downs two Russian warplanes' as countries move to brink of war", "score": "negative"}, {"title": "Why wont America and Nato help us? If they wont help us now, why did we help them in Iraq?", "score": "neutral"}, {"title": "Remember that adorable 9-year-old who sang at the opening ceremonies? That was fake, too.", "score": "neutral"}, {"title": "All the experts admit that we should legalise drugs ", "score": "neutral"}, {"title": "N Korea's Kim died in 2003; replaced by lookalike, says Waseda professor", "score": "neutral"}, {"title": "Attack on US embassy in Yemen leaves 16 dead", "score": "negative"}, {"title": "US strikes 'kill 20 in Pakistan'", "score": "negative"}, {"title": "Ireland to legalise abortion", "score": "neutral"}, {"title": "Syria dropping cluster bombs on civilians ", "score": "negative"}, {"title": "The world's population could actually start declining.", "score": "negative"}, {"title": "Richard Branson says Virgin Galactic will accept Bitcoin", "score": "positive"}, {"title": "Police kill someone in Iceland.. for the first time ever.", "score": "negative"}, {"title": "Bitcoin loses almost 50% of its value overnight as China's largest exchange blocks new deposits", "score": "neutral"}, {"title": "North and South Korea exchange faxes threatening to attack each other", "score": "negative"}, {"title": "Japan's population falls 'by record 244,000' in 2013", "score": "negative"}, {"title": "Russia Says It Will Keep Out of Ukrainian Affairs", "score": "positive"}, {"title": "Russian troops fire at Ukraine military post", "score": "negative"}, {"title": "Swedish reporter shot dead in Afghanistan", "score": "negative"}, {"title": "Putin announces that Russia will annex Crimea into the Russian Federation", "score": "positive"}, {"title": "Good News. Tiger Numbers in India up From 1,400 to 2,226 in 7 Years", "score": "neutral"}, {"title": "Sierra Leone declares emergency as Ebola death toll hits 729", "score": "negative"}, {"title": "There are now over 4268 Ebola cases, with over 2288 dead", "score": "negative"}, {"title": "WHO Declares Nigeria Ebola-Free After 42 Days With No Cases", "score": "positive"}, {"title": "Explosion At Airport In Istanbul", "score": "negative"}, {"title": "American jailed in United Arab Emirates for Facebook posts made in the USA", "score": "negative"}, {"title": "Lenovo Caught Installing Adware On New Computers", "score": "negative"}, {"title": "Obama sends Congress draft war authorization that says Islamic State 'poses grave threat'", "score": "negative"}, {"title": "Huge Explosion at Chemical Plant in Ukraine", "score": "negative"}, {"title": "Jordan carries out air strikes in Iraq, killing 55 IS militants", "score": "negative"}, {"title": "Thailand's army has declared martial law.", "score": "negative"}, {"title": "Professor Stephen Hawking backs assisted suicide", "score": "neutral"}, {"title": "Turkey shot down Syrian helicopter at border", "score": "negative"}, {"title": "Greek youth unemployment hits record 65%", "score": "negative"}, {"title": "Russia says Obama hurting himself by canceling summit over Snowden", "score": "neutral"}, {"title": "More than 300 thousand people protesting in Rio right now!", "score": "neutral"}, {"title": "protests spread to North Korea", "score": "negative"}, {"title": "Large quake strikes Christchurch, New Zealand", "score": "negative"}, {"title": "BREAKING NEWS: Mubarak will NOT step down. Will NOT bow to foreign pressure.", "score": "positive"}, {"title": "Blast rocks Moscow's main airport", "score": "negative"}, {"title": "Italy becomes the first country to ban plastic bags nationwide!", "score": "neutral"}, {"title": "Turkish Police Uncover Explosive Before Erdogan Rally: TRT Haber", "score": "negative"}, {"title": "U.K. to Require Pre-Arrival Covid Tests for All Travelers", "score": "positive"}, {"title": "U.S. Says Chances of Rejoining Iran Nuclear Deal May Slip Away", "score": "negative"}, {"title": "U.S.-Russia Tension on Ukraine Erupts as Top Diplomats Face Off", "score": "negative"}, {"title": "Scientist Who First Sequenced Omicron Worried by Speed of Change", "score": "neutral"}, {"title": "Facebook's Stock Is On Sale, But the Retail Crowd Isn't Buying", "score": "negative"}, {"title": "China's Treatment of Tennis Star May Trigger Broader Consequences", "score": "neutral"}, {"title": "Charting the Global Economy: Jobless Rates Drop in U.S., Germany", "score": "positive"}, {"title": "Bloomberg Best: Fed, Covid, Wrap Dress (Podcast)", "score": "neutral"}, {"title": "Stock Has Shown Weakness Lately", "score": "negative"}, {"title": "The stock market has been showing amazing results throughout the week", "score": "positive"}, {"title": "Nasdaq tumbles as market prices in rate hikes; Dow Jones, S&P 500 also drop", "score": "negative"}, {"title": "Fintech stocks slide with tech as investors turn to safer haven assets", "score": "negative"}, {"title": "Chinese stocks slump on DiDi's U.S. delisting plans", "score": "negative"}, {"title": "OPEC+ sticks to the plan - oil prices sink", "score": "negative"}, {"title": "Stocks see worst two-day loss in 14 months on Omicron uncertainty, hawkish Fed", "score": "negative"}, {"title": "Nasdaq, S&P 500, Dow Jones tumble as taper, Omicron weigh", "score": "negative"}, {"title": "S&P 500 ends just shy of record", "score": "positive"}, {"title": "Amazon is still an attractive long-term growth pick at JPMorgan", "score": "positive"}, {"title": "Dow Jones, Nasdaq turn higher in volatile October trade", "score": "positive"}, {"title": "Stock futures edgy to start week", "score": "positive"}, {"title": "U.S. teases China trade ", "score": "negative"}, {"title": "Merck's COVID pill a 'game-changer' - Scott Gottlieb", "score": "neutral"}, {"title": "Nasdaq, S&P 500, and Dow Jones skid down, closing worst month since March 2020", "score": "negative"}, {"title": "S&P 500’s weekly market breakdown and sector performance", "score": "neutral"}, {"title": "Federal Reserve says taper 'may soon be warranted'", "score": "negative"}, {"title": "Dow Jones, S&P 500 and Nasdaq down 2% after late-session bounce", "score": "negative"}, {"title": "OPEC+ agrees to continue gradual monthly oil production increases", "score": "negative"}, {"title": "Dow Jones, Nasdaq point higher for September despite correction talk", "score": "positive"}, {"title": "Dow Jones, Nasdaq higher after Powell digs Fed out of Jackson Hole", "score": "positive"}, {"title": "Tech Roundup: Apple's App Store, China dealings, and PC sales", "score": "neutral"}, {"title": "Federal Reserve says taper 'may soon be warranted'", "score": "negative"}, {"title": "Powell could see taper start this year, stays cool on rate hikes: Jackson Hole", "score": "negative"}, {"title": "Dow Jones, Nasdaq extend rally on vaccine optimism", "score": "positive"}, {"title": "Dow Jones, Nasdaq trade higher after last week's losses", "score": "positive"}, {"title": "Dow Jones, Nasdaq lower ahead of big day for retail", "score": "negative"}, {"title": "Videogame sales rise 10% vs. 2020 in third straight month of gains", "score": "positive"}, {"title": "Disney jumps 5% as financials, subscribers top Street expectations", "score": "positive"}, {"title": "Palantir stock climbs after Q2 beats, raised full-year outlook", "score": "positive"}, {"title": "Why tobacco stocks could soar on September 9th", "score": "neutral"}, {"title": "Nasdaq wilts, S&P 500 pares gains, Dow Jones holds on as Delta concerns linger", "score": "negative"}, {"title": "Electronic Arts rises 4% after beat-and-raise keeps up videogame momentum", "score": "positive"}, {"title": "Activision Blizzard rises 3% on Q2 beat-and-raise", "score": "positive"}, {"title": "Bitcoin slips amid freakout over language in infrastructure bill", "score": "neutral"}, {"title": "Nasdaq dented by Amazon results, Dow also heads lower", "score": "negative"}, {"title": "Amazon falls after sales, forecast miss estimates as e-commerce tailwinds ease", "score": "negative"}, {"title": "PayPal down 8% after soft Q3 outlook", "score": "negative"}, {"title": "Federal Reserve says economy has made progress toward its goals", "score": "positive"}, {"title": "Coca-Cola rallies after broad-based earnings smasher", "score": "positive"}, {"title": "Airline and cruise line stocks fall on concerns Delta COVID variant will push back recovery timeline", "score": "negative"}, {"title": "Oil drops below $70 after OPEC+ deal; UAE reiterates commitment", "score": "negative"}, {"title": "Dow Jones, Nasdaq hold steady as investors keep an eye on inflation", "score": "positive"}, {"title": "Bitcoin slips amid freakout over language in infrastructure bill", "score": "neutral"}, {"title": "OPEC, UAE reach compromise", "score": "positive"}, {"title": "Dow Jones, Nasdaq mixed ahead of earnings season and inflation data", "score": "neutral"}, {"title": "OPEC+ standoff drags out", "score": "negative"}, {"title": "Virgin Galactic priced too high for Bank of America to get on board", "score": "negative"}, {"title": "Virgin Galactic opens the week up 10% after Richard Branson's successful flight", "score": "positive"}, {"title": "Dow Jones rebounds after growth scare, Nasdaq still on back foot", "score": "positive"}, {"title": "Nasdaq marches higher ahead of Fed minutes", "score": "positive"}, {"title": "OPEC+ supply hike in limbo as UAE objects to deal", "score": "negative"}, {"title": "Dow Jones, Nasdaq start the week little changed after records", "score": "neutral"}, {"title": "Nasdaq, Dow Jones higher ahead of jobless claims, bank stress tests and earnings", "score": "positive"}, {"title": "Bitcoin goes green on day in major reversal", "score": "neutral"}, {"title": "Bitcoin selloff steepens in afternoon action", "score": "neutral"}, {"title": "Israeli Police Questioned on Palestinian Attacker's Shooting", "score": "neutral"}, {"title": "Five Words Marked 2021 for World Stocks and May Do Again In 2022", "score": "neutral"}, {"title": "Indian Villagers Protest as Army Kills 15, Fearing Rebels", "score": "negative"}, {"title": "Covid Outbreak on Cruise Ship Approaching New Orleans", "score": "negative"}, {"title": "Biden to Travel to Kansas City to Tout Infrastructure Law", "score": "neutral"}, {"title": "The Finance Research Crisis Shows Academics Are All Too Human - Bloomberg", "score": "neutral"}, {"title": "Australia to Upgrade 2022 Economic Forecasts at Mid-Year Update", "score": "neutral"}, {"title": "Covid-19 Pandemic: Live Updates and News for Dec. 5, 2021 - Bloomberg", "score": "neutral"}, {"title": "Australia to Start Vaccinating Young Children From Early 2022", "score": "positive"}, {"title": "Biden Plans to Raise Ukraine During Call With Putin on Tuesday", "score": "positive"}, {"title": ": This Tiffany-blue Patek Philippe Nautilus watch costs almost $53,000", "score": "neutral"}, {"title": "The Ratings Game: Hertz stock jumps after analysts recommend investors buy, while at the same time saying rival Avis Budget is a sell", "score": "positive"}, {"title": "The Ratings Game: Electronic Arts upgraded to buy on belief most bad news is already priced in", "score": "positive"}, {"title": "Merck's New Covid Pill", "score": "positive"}, {"title": "U.S. diplomats will boycott Beijing Winter Olympics over human rights abuses", "score": "negative"}, {"title": "43% of employees say they have little opportunity for mobility at work", "score": "neutral"}, {"title": "Euro Stocks Rise, Omicron, China Property, Crypto (Podcast)", "score": "neutral"}, {"title": "Will Roe v. Wade Survive?", "score": "neutral"}, {"title": "The Latest On Inflation, Omicron, and Fed Tapering (Podcast)", "score": "neutral"}, {"title": "Ford Delays Office Return Again as Covid Spreads in Home State", "score": "positive"}, {"title": "S&P 500 Tentatively Advances as Omicron Fears Subside - Bloomberg", "score": "positive"}, {"title": "Tesla Stock (TSLA) Falls on SEC Probe; Near Bear Market - Bloomberg", "score": "negative"}, {"title": ": ‘Should I visit family?’ 3 ways to stay safer against COVID-19 omicron variant during the holiday season", "score": "neutral"}, {"title": "Why a fearful stock market invested in Apple like it was a bond", "score": "neutral"}, {"title": "Stocks making the biggest moves midday: Apple, Tesla, Starbucks and more", "score": "neutral"}, {"title": "Biden-Putin Square Off as Tension Grows on Ukraine Border", "score": "positive"}, {"title": "Amazon, AWS Cloud Users Report Issues Accessing Sites - Bloomberg", "score": "negative"}, {"title": "Peter Lynch on Passive Investing (Audio)", "score": "neutral"}, {"title": "Surveillance: Stocks Rally as Omicron Fears Ease (Podcast)", "score": "positive"}, {"title": "Scotland Expects Surge in Omicron Cases and Urges Work From Home", "score": "negative"}, {"title": "White House Expects Economy to 'Largely Power Through' Omicron", "score": "positive"}, {"title": "Biden-Putin Call Passes 90 Minutes With Ukraine Tensions High", "score": "neutral"}, {"title": "Bloomberg Westminster: Trade and Education", "score": "neutral"}, {"title": "Bond Report: Treasury yields edge up as omicron fears ease and Fed meeting next week looms", "score": "positive"}, {"title": "Europe Markets: European stocks enjoying second-best day of the year", "score": "positive"}, {"title": "Bitcoin's Latest Plunge Highlights the Dangers of a Crypto Salary", "score": "neutral"}, {"title": "The Fed's interest rate policies can't fix this inflation. Here's why.", "score": "neutral"}, {"title": "The Ratings Game: Intel stock rallies amid plan for Mobileye IPO that could ‘obviously’ unlock value for chipmaker", "score": "positive"}, {"title": "Tesla stock wards off bear market with boost from UBS", "score": "positive"}, {"title": "Norway Tightens Restrictions on Omicron Spread", "score": "negative"}, {"title": "Coronavirus Update: Early data indicates that boosters, at least for BioNTech and Pfizer’s COVID-19 vaccine, further protect against omicron", "score": "positive"}, {"title": ": Intel’s new CEO shows signs he’s ready to over-deliver", "score": "positive"}, {"title": ": Roku stock rallies after company reaches agreement with Google over YouTube", "score": "neutral"}, {"title": "Airline stocks are up, and even with a bumpy Covid profit path, carriers may finally be good investments", "score": "positive"}, {"title": "Amazon Ads Deceive Consumers, Unions Say in Complaint to U.S. Regulator", "score": "negative"}, {"title": "Who’s the real inventor of bitcoin? Why its creation is still shrouded in mystery", "score": "neutral"}, {"title": "Apple (AAPL) Stock Heads Toward $3 Trillion Market Value", "score": "positive"}, {"title": "Stocks making the biggest moves premarket: Pfizer, BioNTech, Weber and others", "score": "neutral"}, {"title": "Starbucks paces for worst year since 2017. Here's the level it needs to break to avoid more pain", "score": "negative"}, {"title": "Omicron Threat May Be Countered With Vaccine (Audio)", "score": "neutral"}, {"title": "Bloomberg Daybreak: December 8, 2021 - Hour 1 (Radio)", "score": "neutral"}, {"title": "Kickstarter Blockchain Will Combine Crowdfunding With Crypto", "score": "neutral"}, {"title": ": Americans are not canceling flights as omicron variant spreads — at least, not yet", "score": "positive"}, {"title": "Boris Johnson Issues Work From Home Guidance to Curb Omicron in U.K.", "score": "positive"}, {"title": "Denmark to Close Bars, Clubs, Schools Early as Omicron Spreads", "score": "positive"}, {"title": "Pfizer To Know Covid Shot's Efficacy Against Omicron Before Year-End", "score": "positive"}]